import java.util.ArrayList;
import java.util.List;

public class HangmanWordBank {

    public static final List<String> HANGMANPICS = new ArrayList<>(List.of(
            """
                    
                    +---+
                      |   |
                      O   |
                     /|\\  |
                     / \\  |
                          |
                    =========
                    
                    """,
            """
                    
                    +---+
                      |   |
                      O   |
                     /|\\  |
                     /    |
                          |
                    =========
                    
                    """,
            """
                    
                    +---+
                      |   |
                      O   |
                     /|\\  |
                          |
                          |
                    =========
                    
                    """,
            """
                    
                    +---+
                      |   |
                      O   |
                     /|   |
                          |
                          |
                    =========
                    
                    """,
            """
                     
                     +---+
                      |   |
                      O   |
                      |   |
                          |
                          |
                    =========
                    
                    """,
            """
                    
                    +---+
                      |   |
                      O   |
                          |
                          |
                          |
                    =========
                    
                    """,
            """
                    
                    +---+
                    |   |
                    |
                    |
                    |
                    |
                    =========
                    
                    """
            ));

    public static final List<String> WORDBANK = new ArrayList<>(List.of(
            "Кант", "Хроника", "Зал", "Галера", "Балл", "Вес", "Кафель", "Знак", "Фильтр", "Башня",
            "Кондитер", "Омар", "Чан", "Пламя", "Банк", "Тетерев", "Муж", "Камбала", "Груз", "Кино", "Лаваш",
            "Калач", "Геолог", "Бальзам", "Бревно", "Жердь", "Борец", "Самовар", "Карабин", "Подлокотник", "Барак",
            "Мотор", "Шарж", "Сустав", "Амфитеатр", "Скворечник", "Подлодка", "Затычка", "Ресница", "Спичка",
            "Кабан", "Муфта", "Синоптик", "Характер", "Мафиози", "Фундамент", "Бумажник", "Библиофил", "Дрожжи",
            "Развлечение", "Конечность", "Пробор", "Дуст", "Комбинация", "Мешковина", "Процессор", "Крышка", "Сфинкс",
            "Пассатижи", "Фунт", "Кружево", "Агитатор", "Формуляр", "Прокол", "Абзац", "Караван", "Леденец", "Кашпо",
            "Баркас", "Кардан", "Вращение", "Заливное", "Метрдотель", "Клавиатура", "Радиатор", "Сегмент", "Обещание",
            "Магнитофон", "Кордебалет", "Заварушка"
    ));

}
